{"reviewerID": "AKM1MP6P0OYPR", "asin": "0132793040", "reviewerName": "Vicki Gibson \"momo4\"", "helpful": [1, 1], "reviewText": "Corey Barker does a great job of explaining Blend Modes in this DVD. All of the Kelby training videos are great but pricey to buy individually. If you really want bang for your buck just subscribe to Kelby Training online.", "overall": 5.0, "summary": "Very thorough", "unixReviewTime": 1365811200, "reviewTime": "04 13, 2013"}
{"reviewerID": "A2CX7LUOHB2NDG", "asin": "0321732944", "reviewerName": "Bernie", "helpful": [0, 0], "reviewText": "While many beginner DVDs try to teach you everything there is to know about Photoshop CS5, this introductory course shows you the critical things you need to know to start feeling confident in your Photoshop skills. Bestselling author and Photoshop trainer, Matt Kloskowski shows you exactly what you need to know about tools, filters, adjustments, palettes, and menu items to hit the ground running in Photoshop. These include: layers and how they're key to mastering Photoshop, selections and the essential tools you really need to worry about, getting started with Camera Raw and which Retouching tools you'll find the most helpful. When you're done with this DVD you'll have a solid grasp of the most important features and be at the next level in no time.", "overall": 5.0, "summary": "Adobe Photoshop CS5 Crash Course with master Photoshop trainer, Matt Kloskowski", "unixReviewTime": 1341100800, "reviewTime": "07 1, 2012"}
{"reviewerID": "A1GI0U4ZRJA8WN", "asin": "0439886341", "reviewerName": "Truthfull", "helpful": [4, 4], "reviewText": "Do not waste your money on this thing it is terrible i boutght this product for my son and when i put in phone numbers for him to remember or the date and  it would always reset then i would have to do it all over again i couldn't do anything about it it was getting very frustrating so we just threw it away DO NOT Absolutely DO NOT SPEND YOUR MONEY ON THIS", "overall": 1.0, "summary": "TERRIBLE DONT WASTE YOUR MONEY", "unixReviewTime": 1334707200, "reviewTime": "04 18, 2012"}
{"reviewerID": "A1QGNMC6O1VW39", "asin": "0511189877", "reviewerName": "CK", "helpful": [0, 0], "reviewText": "Dog got the old remote and destroyed it.  Didn't feel like explaining to the folks at the Time Warner Cable office what happened.  Saw the price on Amazon for this one and chose the low hassle option.  It works perfectly.  Price was right.", "overall": 5.0, "summary": "Works Great with my TWC box", "unixReviewTime": 1397433600, "reviewTime": "04 14, 2014"}
{"reviewerID": "A29LPQQDG7LD5J", "asin": "0528881469", "reviewerName": "Alfred Delgado", "helpful": [0, 0], "reviewText": "I have owned two Rand McNally GPS devices over the last two years. Buyer beware! They are pieces of junk. The software is great, but the hardware does not last. The first GPS lasted a year. I spent another $400, that one lasted about 14 months. If you don't mind spending $400 a year for a GPS buy one. Otherwise do not buy it it is the worst and most expensive piece of junk I have ever bought. I still use my original GARMIN I purchased in 2006.", "overall": 1.0, "summary": "Piece of Junk", "unixReviewTime": 1352073600, "reviewTime": "11 5, 2012"}
{"reviewerID": "A1NQPG5IJ43HJI", "asin": "0558835155", "reviewerName": "William J. Saylor", "helpful": [0, 0], "reviewText": "Works ok, but I do not like the feel of the ear pieces, they are hard to keep on your ear, would not recommend.", "overall": 3.0, "summary": "Works ok, but ear pieces are uncomfortable", "unixReviewTime": 1372550400, "reviewTime": "06 30, 2013"}
{"reviewerID": "A22FB2WSZSXSHH", "asin": "059400232X", "reviewerName": "Kayti", "helpful": [1, 2], "reviewText": "I bought this for my daughter. I'm the writer she's the reader..so it fit. lolThis cover is beautiful, and sturdy. Makes the nook have the look and feel of a real book. And according to my daughter is inconspicuous in class. :)It's synthetic leather but it's very elegant. Also. It's not gender specific. My Son wouldn't feel embarrassed to carry it around. :)", "overall": 5.0, "summary": "Beautiful", "unixReviewTime": 1348790400, "reviewTime": "09 28, 2012"}
{"reviewerID": "AZQZ3STMCBG5H", "asin": "059400232X", "reviewerName": "Rose Mitchell", "helpful": [0, 0], "reviewText": "Very happy.with.my nook cover.  I want one with a different quote but this one is fine.  I love the cover.", "overall": 5.0, "summary": "love it.", "unixReviewTime": 1395705600, "reviewTime": "03 25, 2014"}
{"reviewerID": "A2EGPA22UHMQXL", "asin": "0594012015", "helpful": [0, 0], "reviewText": "Didn't work, had to send back", "overall": 1.0, "summary": "One Star", "unixReviewTime": 1405296000, "reviewTime": "07 14, 2014"}
{"reviewerID": "AC57CU3TF6ZMJ", "asin": "0594012015", "reviewerName": "Becky K.", "helpful": [0, 0], "reviewText": "just what I needed!", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1404172800, "reviewTime": "07 1, 2014"}
{"reviewerID": "A2YX0Z6RHA8Y2H", "asin": "0594012015", "reviewerName": "Chortovka", "helpful": [0, 0], "reviewText": "I need to buy my third power cord within 1 year.  I refuse to do so.  The Nook power cord is NOT designed to last and causes nothing but problems ... it's either discharging or not charging.  And, I'm dismayed that I cannot buy a Nook external charger to charge my Nook while on a 3 week vacation.  I'm giving up the Nook and going to a Kindle Fire.", "overall": 1.0, "summary": "Power Cord", "unixReviewTime": 1384300800, "reviewTime": "11 13, 2013"}
{"reviewerID": "A38T51B7J6QVD9", "asin": "0594012015", "reviewerName": "emma young bey", "helpful": [1, 1], "reviewText": "Does not charde the Nook tablet or Nook color as states. Has een in touch with company for feedback and NOTHING...Never again", "overall": 1.0, "summary": "Does not work", "unixReviewTime": 1377129600, "reviewTime": "08 22, 2013"}